Revit 2026 API

# ReferencePlaneFreeEnd Property

---

The free end of the reference plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ FreeEnd { get; set; }
```
```vb
Public Property FreeEnd As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ FreeEnd {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member FreeEnd : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

When setting this property, an exception will be thrown if the free end is set to almost the same point as bubble end or if the vector from BubbleEnd -> FreeEnd is not perpendicular to the normal vector.

#### Reference

ReferencePlane Class

Autodesk.Revit.DB Namespace